# 함수 선언과 실행

## 함수가 뭔데

- **변수는 값을 저장하는거라면 함수는 명령들을 저장하는 것**
## 함수 사용
* 함수를 사용하는 법
```
// 함수 선언 방법
function 함수(){
  명령어를 씨언어처럼 씨불씨불
};
```

이렇게 함수를 선언 할 수 있고 선언한 함수를 그냥 사용하려면 사용 하지 못하고 함수를 호출해줘야 합니다

함수를 호출하는 방법은

```
//함수 선언
function Hello(){
  console.log("HI");
  console.log("ㅎㅇ");
};

//함수 호출
Hello()
```

이렇게 하면 콘솔에는 

HI
ㅎㅇ

이 두 단어가 뜨게 됩니다.

> # 그래서 이걸 왜 쓰는데

코드가 길어지게 되서 여러번 반복 해야 하는 상황일때 코드가 100줄이 될껄 함수선언 50줄과 2줄의 호출로 끝낼 상황이 올 수 있는거죠

# console.log 도 함수다

자바스크립트를 만든 개발자들이 console.log라는 함수를 만들어 둔거죠 console.log 라는 함수만 알아도 콘솔에 넣을 수 있게 되는거죠 그니까 함수 안에 복잡한 코드는 모두 넣어두고 함수 이름만 잘 지어두면 코드를 짜고 실행하는데 훨씬 편해지는 것 이죠


